// 5. Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.
// 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4" 
//  2 -> " -2, -1, 0, 1, 2"
Console.WriteLine("Введите число");
int num1 = Convert.ToInt32(Console.ReadLine());
int count = -num1;
while (count == num1)
{
  int what = new Random().Next(0, 3); //(0.3)0,1,2
if (what == 0)
{n(x, y);
Console.WriteLine("+");
count = count+1;
}